package com.example.androidlabs

object ActivitiesList {
    fun getActivityData(): List<TaskItem> = listOf(
        TaskItem("14.32 км", "2 часа 46 минут", "Серфинг", "14 часов назад", "me"),
        TaskItem("1000 м", "60 минут", "Велосипед", "29.05.2022", "me"),
        TaskItem("5.5 км", "45 минут", "Бег", "12.04.2022", "me"),
        TaskItem("3.2 км", "30 минут", "Ходьба", "10.04.2022", "me"),
        TaskItem("228 м", "14 час 48 минут", "Качели", "14 часов назад", "me"),
        TaskItem("10 км", "1 час 10 минут", "Езда на кадилак", "14 часов назад", "vadik228"),
        TaskItem("6.5 км", "55 минут", "Бег", "28.03.2022", "amytrip"),
        TaskItem("4.2 км", "40 минут", "Ходьба", "25.03.2022", "custom_stories"),
        TaskItem("10.3 км", "1 час 30 минут", "Велосипед", "20.03.2022", "metalyst"),
        TaskItem("7.8 км", "1 час 5 минут", "Бег", "15.03.2022", "babai"),
        TaskItem("5 км", "50 минут", "Ходьба", "10.03.2022", "andrux")
    )
}